In [15]:
import pandas as pd
import numpy as np

## Eksik veri

In [7]:
data = {"Istanbul": [30,29,np.nan], "Istanbul": [30,29,np.nan], "Izmir": [28,np.nan, 27], "Ankara": [30,29,40], "Antalya": [40, np.nan, np.nan] }
havaDurumuDaraFrame = pd.DataFrame(data)

In [8]:
havaDurumuDaraFrame

   Istanbul  Izmir  Ankara  Antalya
0      30.0   28.0      30     40.0
1      29.0    NaN      29      NaN
2       NaN   27.0      40      NaN

In [9]:
havaDurumuDaraFrame.dropna() 
# Eğer bir sutun veya satırda na değeri varsa göstermez

   Istanbul  Izmir  Ankara  Antalya
0      30.0   28.0      30     40.0

In [12]:
havaDurumuDaraFrame.dropna(axis=1)
#axis 0 = satır, axis = 1 = sütun

   Ankara
0      30
1      29
2      40

In [13]:
havaDurumuDaraFrame.dropna(axis=1, thresh=2)
#Bir satır veya kolaondaki eksik veri sınırı = thresh

   Istanbul  Izmir  Ankara
0      30.0   28.0      30
1      29.0    NaN      29
2       NaN   27.0      40

In [14]:
havaDurumuDaraFrame.fillna(0)
# nan olanları girilen değerlerle doldur

   Istanbul  Izmir  Ankara  Antalya
0      30.0   28.0      30     40.0
1      29.0    0.0      29      0.0
2       0.0   27.0      40      0.0

## Group By

In [19]:
newData = {"Departman": ["Yazılım", "Satış", "Satış", "Yazılım"],
          "Employes": ["Ahmet", "Mehmet", "Atıl", "Burak"],
           "Salary" : [100, 150, 200, 300]
          }
maasDataFrame = pd.DataFrame(newData)
maasDataFrame

  Departman Employes  Salary
0   Yazılım    Ahmet     100
1     Satış   Mehmet     150
2     Satış     Atıl     200
3   Yazılım    Burak     300

In [22]:
groupBy = maasDataFrame.groupby("Departman")

In [26]:
groupBy.mean()
groupBy.min()
groupBy.max()
groupBy.describe() #acık aralık ort vs bütün hesaplamaları yayıp döndürüyor

          Salary
           count   mean         std    min    25%    50%    75%    max
Departman
Satış        2.0  175.0   35.355339  150.0  162.5  175.0  187.5  200.0
Yazılım      2.0  200.0  141.421356  100.0  150.0  200.0  250.0  300.0

## DataFrameleri birleştrime(Concat)

In [30]:
data1 = {"Isım":["Ahmet", "Mehmet", "Zeynep", "Atıl"],
        "Spor": ["Koşu", "Yüzme", "Basketbol", "Koşu"],
        "Kalori": [100, 200, 150, 275]}

data2 = {"Isım":["Levent", "Fatih", "Atlas", "Fatma"],
        "Spor": ["Koşu", "Yüzme", "Basketbol", "Koşu"],
        "Kalori": [120, 754, 130, 245]}

data3 = {"Isım":["Ayşe", "Matmut", "Duygu", "Nur"],
        "Spor": ["Koşu", "Yüzme", "Basketbol", "Koşu"],
        "Kalori": [170, 354, 40, 241]
        }

dataFrame1 = pd.DataFrame(data1, index = [0, 1, 2, 3])
dataFrame2 = pd.DataFrame(data2, index = [4, 5, 6, 7])
dataFrame3 = pd.DataFrame(data3, index = [8, 9, 10, 11])

In [44]:
pd.concat([dataFrame1, dataFrame2, dataFrame3], axis = 0)
#İki tabloyu alt alta ekleme

      Isım       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep  Basketbol     150
3     Atıl       Koşu     275
4   Levent       Koşu     120
5    Fatih      Yüzme     754
6    Atlas  Basketbol     130
7    Fatma       Koşu     245
8     Ayşe       Koşu     170
9   Matmut      Yüzme     354
10   Duygu  Basketbol      40
11     Nur       Koşu     241

## Merge

In [45]:
mergeData1 = {"Isim": ["Ali", "Veli", "Mehmet", "Hasan"],
             "Spor": ["Basketbol", "Futbol", "Tenis", "Gym"]
             }

mergeData2 = {"Isim": ["Ali", "Veli", "Mehmet", "Hasan"],
             "Kalori": [100, 200, 300, 400]
             }

mergeFrame1 = pd.DataFrame(mergeData1)
mergeFrame2 = pd.DataFrame(mergeData2)

In [46]:
pd.merge(mergeFrame1, mergeFrame2, on = "Isim")
#İki tabloyu ortak kolon üzerinden birleştirme

     Isim       Spor  Kalori
0     Ali  Basketbol     100
1    Veli     Futbol     200
2  Mehmet      Tenis     300
3   Hasan        Gym     400

## Operations

In [50]:
maasData = {"Isim": ["Ali", "Veli", "Mehmet", "Hasan"],
           "Departman": ["Yazılım", "Satış", "Yazılım", "Hukuk"],
           "Maas": [100, 200, 300, 400]
           }

maasDataFrame = pd.DataFrame(maasData)

In [52]:
maasDataFrame["Departman"].unique() #Verileri tekrarsız getirir
maasDataFrame["Departman"].nunique() # Tekrarsız verilerin sayısını(count)

3

In [53]:
maasDataFrame["Departman"].value_counts() 
#Hangi veriden kaç adet var onun saygısını geri döndürür

Yazılım    2
Satış      1
Hukuk      1
Name: Departman, dtype: int64

In [59]:
#Tanımlanan fonksiyonu sahip olduğumuz verilere uygulama
def bruttenNete(maas):
    return maas * 0.80

maasDataFrame["Maas"].apply(bruttenNete)

0     80.0
1    160.0
2    240.0
3    320.0
Name: Maas, dtype: float64

## Pivot Table

In [64]:
pivotData = {"Sınıf": ["Simpson", "Simpson", "S.Park", "S.Park"],
            "Name": ["Homer", "Bart", "Cartman", "Kenny"],
             "Age": [10, 20, 30, 40]
            }

pivotFrame = pd.DataFrame(pivotData)
pivotFrame

     Sınıf     Name  Age
0  Simpson    Homer   10
1  Simpson     Bart   20
2   S.Park  Cartman   30
3   S.Park    Kenny   40

In [69]:
pivotFrame.pivot_table(values = "Age", index = ["Sınıf", "Name"], aggfunc=np.sum)
#Eğer aynı isimden bir adet daha varsa default ortalama alır
#Ya da aggfunc'la uygulanacak işlemi belirleyebiliriz.

                 Age
Sınıf   Name
S.Park  Cartman   30
        Kenny     40
Simpson Bart      20
        Homer     10